## Setup

In [3]:
import pandas as pd
import sqlite3

# Connect to database
conn = sqlite3.connect('titanic.db')
print("Connected to database")

titanic = pd.read_csv("Titanic Dataset.csv")
conn = sqlite3.connect("titanic.db")

titanic.to_sql(
    name='passengers',           # The name of the SQL table we want to create in the database
    con=conn,                    # The active database connection (created with sqlite3.connect)
    if_exists='replace',         # If a table named 'passengers' already exists, delete it and write a new one
    index=False                  # Don't store the DataFrame's index as its own column in the database
)

Connected to database

1309

## Characteristics
- Age 45 - 55
- Traveling second class
- Traveling with family

## Query

In [5]:
query = """
SELECT Name, Age, Sex, Pclass 
FROM passengers
WHERE Age BETWEEN 45 AND 55
AND Sex = 'male'
AND pclass = 2
ORDER BY Age
"""

results = pd.read_sql(query, conn)
display(results)

                             name   age   sex  pclass
0         McKane, Mr. Peter David  46.0  male       2
1            Gilbert, Mr. William  47.0  male       2
2         Jarvis, Mr. John Denzil  47.0  male       2
3    Milling, Mr. Jacob Christian  48.0  male       2
4              Herman, Mr. Samuel  49.0  male       2
5         Hodges, Mr. Henry Price  50.0  male       2
6    Louch, Mr. Charles Alexander  50.0  male       2
7      Bateman, Rev. Robert James  51.0  male       2
8      Chapman, Mr. Charles Henry  52.0  male       2
9           Greenberg, Mr. Samuel  52.0  male       2
10  Carter, Rev. Ernest Courtenay  54.0  male       2
11     Downton, Mr. William James  54.0  male       2
12           Moraweck, Dr. Ernest  54.0  male       2